app/controllers/freedays_controller.rb

INSERT INTO "freedays" ("start", "stop", "nazwa", "created_at", "updated_at") VALUES('2013-02-03 22:48:00', '2013-02-28 22:48:00', 'Sesja zimowa', '2013-02-03 21:49:01', '2013-02-03 21:49:01')
---
  def create
    @freeday = Freeday.new(params[:freeday])
			@freeday.start = params[:start]
			@freeday.stop = params[:stop]

    respond_to do |format|
      if @freeday.save