app/controllers/main_controller.rb

SELECT "groups".*, t0.plan_id as the_parent_record_id FROM "groups" INNER JOIN "groups_plans" t0 ON "groups".id = t0.group_id WHERE (t0.plan_id = 1)
SELECT * FROM "plans" WHERE ("plans"."sala" = '120' AND "plans"."plan_id" = 1)
---
  def showroom
	  @blok = 0
		@line = 0
	  @blok_ln = {'pon' => 0, 'wto' => 0, 'sro' => 0, 'czw'=> 0, 'pia' => 0}
    if request.get?
			if !params[:room][:sala].nil?
	      @sala = params[:room][:sala]
	      @mins = Plan.find(:all, :include => :groups, :conditions => {:sala => @sala, :plan_id => getViewPlan})

SELECT * FROM "reservations" WHERE ("reservations"."waznosc" IN ('2013-01-28') AND "reservations"."sala" = '120')
---
  def rezerwacje
		@line = 0
		@blok = 0
		@blok_ln = {'pon' => 0, 'wto' => 0, 'sro' => 0, 'czw'=> 0, 'pia' => 0, 'sob' => 0, 'nie' => 0}
    if params[:data].nil?
			@date = Date.parse(Time.now.strftime("%d-%m-%Y")).beginning_of_week
    else
			@date = Date.parse(params[:data]).beginning_of_week
    end
    if params[:room][:sala].nil?
		  @sala = "04"
    else
			@sala = params[:room][:sala]
    end
    @room = Room.new

    if request.get?
      @rezerwacje =  Reservation.where('waznosc BETWEEN ? AND ?', @date.beginning_of_day, @date.end_of_week.end_of_day).where(:sala => @sala )

SELECT * FROM "settings" LIMIT 1
---
    def set_unit_name
      @unit_name = Settings.first.unit_name