app/controllers/schedules_controller.rb

  def index
    authorize! :manage, Schedule
    @schedules = Schedule.find(:all)
---
SELECT * FROM "schedules" WHERE ("schedules"."id" IS NULL) LIMIT 1

  def show
    authorize! :manage, Schedule
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" IS NULL) LIMIT 1

  def edit
    authorize! :manage, Schedule
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 1) LIMIT 1

  def create
    authorize! :manage, Schedule
    @schedule = Schedule.new(params[:schedule])

    respond_to do |format|
      if @schedule.save
---
INSERT INTO "schedules" ("nazwa", "rok", "created_at", "updated_at") VALUES('Zimowy 2012/2013', '2012/2013', '2013-02-03 21:27:42', '2013-02-03 21:27:42')

  def update
    authorize! :manage, Schedule
    @schedule = Schedule.find(params[:id])

    respond_to do |format|
      if @schedule.update_attributes(params[:schedule])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)
UPDATE "schedules" SET "nazwa" = 'Zimowy', "updated_at" = '2013-02-03 22:06:33' WHERE "id" = 1