app/controllers/siatka_controller.rb

SELECT * FROM "plans" WHERE ("plans"."id" = '1') LIMIT 1
SELECT * FROM "groups" INNER JOIN "groups_plans" ON "groups".id = "groups_plans".group_id WHERE ("groups_plans".plan_id = 1 )
---
  def edit
    @sale = Room.find(:all)
    @salee = []
    for pl in @sale
      @salee << pl.numer
    end
      @salee = @salee.sort { |a,b| a.to_i <=> b.to_i}
    @tmp = params[:id].to_s.split(":")
    if @tmp[0] == "IDR"
      @dodaj = Reservation.find(@tmp[1])
    else
      @dodaj = Plan.find_by_id(@tmp[1])
			@grupy = Array.new
			for i in @dodaj.groups

SELECT * FROM "plans" WHERE ("plans"."sala" = '1' AND "plans"."plan_id" = 2)
---
  def preview
    flash[:notice] = ""
    @dodaj = Plan.new
		@plany = Array.new
		@kursy = Array.new
    if request.post?
      @ustawGrupe = params[:g]
      @ustawSala = params[:dodaj][:sala]
      @sale = Plan.find(:all, :conditions => {:sala => params[:room][:numer], :plan_id => getEditPlan})

SELECT * FROM "groups" INNER JOIN "groups_plans" ON "groups".id = "groups_plans".group_id WHERE ("groups_plans".plan_id = 1 )
SELECT * FROM "plans" WHERE ("plans"."sala" = '120' AND "plans"."plan_id" = 2)
---
  def add
    @dodaj = Plan.new
    @sale = Room.find(:all)
    @salee = []
    for pl in @sale
      @salee << pl.numer
    end
    @salee = @salee.sort { |a,b| a.to_i <=> b.to_i}
    if request.get?
				if !params[:grupa].nil?
	        for i in params[:grupa]
  		        @test = i.split("")
							@ustawGrupe = i
   	  	   		@tmp = @test[0].to_s + @test[1].to_s
   	 		  end
     		 	@kursy = Plan.find(:all, :include => :groups, :conditions => {'groups.nazwa' => "#{@tmp}", :plan_id => getEditPlan})
     		 	@plany = Plan.find(:all, :include => :groups, :conditions => {'groups.nazwa' => @ustawGrupe, :plan_id => getEditPlan })
    		  @sl = Plan.find(:all, :conditions => {:sala =>params[:sala], :plan_id => getEditPlan})

SELECT * FROM "subjects" WHERE ("subjects"."nazwa" = 'Matematyka') LIMIT 1
INSERT INTO "subjects" ("nazwa", "katedra", "created_at", "updated_at") VALUES('Matematyka', '', '2013-02-03 22:05:41', '2013-02-03 22:05:41')
SELECT * FROM "lecturers" WHERE ("lecturers"."lecture" = 'Antoni Kowalczyk') LIMIT 1
---
  def adding
    if params[:room][:numer].empty?
	flash[:error] = "Niekompletny wpis: brakuje pola Sala"
          redirect_to :action => "add", :params => {:godz => params[:dodaj][:godz], :katedra => params[:dodaj][:katedra], :dni => params[:dodaj][:dni], :grupa => params[:dodaj][:grupa], :dlugosc => params[:dodaj][:dlugosc], :sala => params[:room][:numer], :prowadzacy => params[:lecturer][:lecture], :czestotliwosc => params[:dodaj][:czestotliwosc],:przedmiot => params[:subject][:nazwa], :rodzaj => params[:dodaj][:rodzaj], :budynek => params[:dodaj][:budynek], :uwagi => params[:dodaj][:uwagi] }

    elsif
      if params[:dodaj][:grupa].nil?
         flash[:error] = "Niekompletny wpis: brakuje pola Grupa"
          redirect_to :action => "add", :params => {:godz => params[:dodaj][:godz], :katedra => params[:dodaj][:katedra], :dni => params[:dodaj][:dni], :grupa => "", :dlugosc => params[:dodaj][:dlugosc], :sala => params[:room][:numer], :prowadzacy => params[:lecturer][:lecture], :czestotliwosc => params[:dodaj][:czestotliwosc],:przedmiot => params[:subject][:nazwa], :rodzaj => params[:dodaj][:rodzaj], :budynek => params[:dodaj][:budynek], :uwagi => params[:dodaj][:uwagi] }

      end

   else

    if params[:date].nil?
       @date = "1-09-2008"
    else
       @date = params[:date]
    end
    @kom1 = params[:dodaj][:dlugosc].to_i * 3
    @Gz = params[:dodaj][:godz].to_i
  #  @kom = @dodaj4.to_f * 3
  #  @kom1 = @kom.to_i
    @jest = 0
    @przedmiot = Subject.find(:first, :conditions => { :nazwa => params[:subject][:nazwa] })
    if @przedmiot.nil?
      @przed = Subject.new
      @przed.nazwa = params[:subject][:nazwa]
      @przed.katedra = params[:dodaj][:katedra]
      @przed.save
    end
    @prowadzacy = Lecturer.find(:first, :conditions => { :lecture => params[:lecturer][:lecture] })

INSERT INTO "lecturers" ("title", "lecture", "created_at", "updated_at") VALUES(NULL, 'Antoni Kowalczyk', '2013-02-03 22:05:41', '2013-02-03 22:05:41')
---
    if @prowadzacy.nil?
      @prowadzacy = Lecturer.new
      @prowadzacy.lecture = params[:lecturer][:lecture]
      @prowadzacy.save

SELECT * FROM "plans" WHERE (id NOT LIKE '' AND prowadzacy LIKE '' AND plan_id = '2' AND dni LIKE 'pon' AND sala LIKE 'pon')
SELECT * FROM "reservations" WHERE (sala = '120' AND dni ='pon' AND id NOT LIKE '' AND waznosc >= '2013-02-03')
---
    else
 # sprawdzanie dostępności sali
   if params[:room][:numer].to_s != "WF" && params[:room][:numer].to_s != "SJO"
    @sp = Plan.find(:all, :conditions =>  ["id NOT LIKE '#{params[:dodaj][:id]}' AND sala = '#{params[:room][:numer]}' AND dni = '#{ params[:dodaj][:dni]}' AND plan_id = '#{getEditPlan}'"])
  # mtfk
  # tymczasowy fix na kolizje zajec ze starym semestrem
  #  @sp2 = Reservation.find(:all, :conditions => "sala = '#{params[:room][:numer]}' AND dni ='#{params[:dodaj][:dni]}' AND id NOT LIKE '#{params[:dodaj][:id]}' AND waznosc >= '#{Date.parse(Time.now.strftime('%d-%m-%Y'))}'")
    @sp2 = Reservation.find(:all, :conditions => "sala = '#{params[:room][:numer]}' AND dni ='#{params[:dodaj][:dni]}' AND id NOT LIKE '#{params[:dodaj][:id]}' AND waznosc >= '#{Date.parse('25-02-2013')}'")

SELECT * FROM "groups" WHERE ("groups"."nazwa" = '1IN1') LIMIT 1
---
      @test = i.split("")
      @tmp = @test[0].to_s + @test[1].to_s
			if !params[:dodaj][:id].nil?
     		@kursy = Plan.find(:all, :include => :groups, :conditions => [" plans.plan_id = ? AND groups.nazwa = ? AND dni = ? AND plans.id <> ?",getEditPlan, @tmp,params[:dodaj][:dni],params[:dodaj][:id]] )

SELECT * FROM "settings" WHERE ("settings"."id" = 1)
INSERT INTO "plans" ("godz", "dni", "prowadzacy", "budynek", "sala", "katedra", "grupa", "przedmiot", "rodzaj", "dlugosc", "czestotliwosc", "uwagi", "created_at", "updated_at", "wazneod", "waznedo", "plan_id") VALUES('480', 'pon', 'Antoni Kowalczyk', NULL, '120', '', NULL, 'Matematyka', 'W', 1, 1, '', '2013-02-03 22:05:41', '2013-02-03 22:05:41', NULL, NULL, 2)
---
     		 @del = Plan.find_by_id(params[:dodaj][:id])
     		 @del.destroy
   		 end
			@planid = Setting.find(:first)
			@pp = Plan.create(:plan_id => @planid.plan_to_edit , :godz => params[:dodaj][:godz], :katedra => params[:dodaj][:katedra], :dni => params[:dodaj][:dni], :dlugosc => params[:dodaj][:dlugosc], :sala => params[:room][:numer], :prowadzacy => params[:lecturer][:lecture], :czestotliwosc => params[:dodaj][:czestotliwosc],:przedmiot => params[:subject][:nazwa], :rodzaj => params[:dodaj][:rodzaj], :budynek => params[:dodaj][:budynek], :uwagi => params[:dodaj][:uwagi])

UPDATE "settings" SET "plan_to_edit" = 2, "updated_at" = '2013-02-03 21:38:08' WHERE "id" = 1
---
	def konfiguracja
	  @config = Setting.find(:first)
		if request.post?
			if !params[:config][:current_plan].nil? && !params[:config][:plan_to_edit].nil?
     		@config.current_plan = params[:config][:current_plan]
				@config.plan_to_edit = params[:config][:plan_to_edit]
				@config.save